In [1]:
import numpy as np
import pandas as pd
from sklearn import linear_model

In [11]:
df = pd.read_csv("D:\\Code_bites\\HR_Hiring.csv")

In [12]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [13]:
df.columns = ['exp','test','interview','salary']

In [15]:
df.exp= df['exp'].fillna('zero')

In [16]:
df.head()

     exp  test  interview  salary
0   zero   8.0          9   50000
1   zero   8.0          6   45000
2   five   6.0          7   60000
3    two  10.0         10   65000
4  seven   9.0          6   70000

In [6]:
#pip install word2number

In [7]:

from word2number import w2n

In [20]:
# Convert numeric words to numbers
# Using word2number
df['exp']= df['exp'].apply(w2n.word_to_num)
df

   exp  test  interview  salary
0    0   8.0          9   50000
1    0   8.0          6   45000
2    5   6.0          7   60000
3    2  10.0         10   65000
4    7   9.0          6   70000
5    3   7.0         10   62000
6   10   NaN          7   72000
7   11   7.0          8   80000

In [21]:
test_med = df['test'].median()

In [22]:
test_med

8.0

In [24]:
df['test']= df['test'].fillna(test_med)
df

   exp  test  interview  salary
0    0   8.0          9   50000
1    0   8.0          6   45000
2    5   6.0          7   60000
3    2  10.0         10   65000
4    7   9.0          6   70000
5    3   7.0         10   62000
6   10   8.0          7   72000
7   11   7.0          8   80000

In [26]:
reg =linear_model.LinearRegression()

In [27]:
reg.fit(df[['exp','test','interview']],df['salary'])

LinearRegression()

In [28]:
reg.coef_

array([2812.95487627, 1845.70596798, 2205.24017467])

In [29]:
reg.intercept_

17737.26346433771

In [31]:
# Prediction
sal=reg.predict([[2,9,6]])
print ("Recomonded salary for an individual with 2 years experience , test score of 9 and interview score of 6 \n " , sal)

Recomonded salary for an individual with 2 years experience , test score of 9 and interview score of 6
  [53205.96797671]

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

In [32]:
sal=reg.predict([[12,10,10]])
print ("Recomonded salary for an individual with 12 years experience , test score of 10 and interview score of 10 \n " , sal)

Recomonded salary for an individual with 12 years experience , test score of 10 and interview score of 10
  [92002.18340611]

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(